public/si-shu.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-05-02 Sat 09:09 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>四书</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jack Liu">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">四书</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf28eafb">大学</a>
<ul>
<li><a href="#org5342124">经</a></li>
</ul>
</li>
</ul>
</div>
</div>
<blockquote>
<p>
南宋朱熹将《大学》、《中庸》、《论语》、《孟子》合编注释，称为《四书》。
</p>
</blockquote>

<div id="outline-container-orgf28eafb" class="outline-2">
<h2 id="orgf28eafb">大学</h2>
<div class="outline-text-2" id="text-orgf28eafb">
<p>
→ <a href="https://so.gushiwen.org/guwen/book_20.aspx">大学</a>
</p>

<blockquote>
<p>
《大学》原为《礼记》第四十二篇。宋朝程颢、程颐兄弟把它从《礼记》中抽出，编次章句。朱熹把《大学》重新编排整理，分为“经”一章，“传”十章。认为，“经一章孔子之言，而曾子述之；其传十章，则曾子之意而门人记之也。”
</p>
</blockquote>

<p>
“大学”是对“小学”而言，是说它不是讲“详训诂，明句读”的“小学”，而是讲治国安邦的“大学”。“小学”即：“洒扫应对进退，礼乐射御书数”。“大学”是大人之学，古人十五岁入学，学习伦理、政治和哲学等“穷理正心，修理治人”的学问，实则是学习如何参与国家政治。
</p>

<p>
《大学》为“初学入德之门也”。经一章提出了 <span class="underline">明明德、亲民、止于至善</span> 三条纲领，又提出了 <span class="underline">格物、致知、诚意、正心、修身、齐家、治国、平天下</span> 八个条目。八个条目是实现三条纲领的途径。在八个条目中， <span class="underline">修身</span> 是根本的一条，“自天子以至于庶人，壹是皆以修身为本”。十章分别解释：
</p>
<ul class="org-ul">
<li><span class="underline">明明德</span> 是指弘扬光明正大的品德；</li>
<li><span class="underline">新民</span> 是指让人们革旧图新；</li>
<li><span class="underline">止于至善</span> 是指要达到最好的境界；</li>
<li><span class="underline">本末</span> 是指做事要分清主次，抓住根本；</li>
<li><span class="underline">格物、致知</span> 是指穷究事物的原理来获得知识；</li>
<li><span class="underline">诚意</span> 就是“毋自欺”，不要“掩其不善而著其善”；</li>
<li><span class="underline">正心</span> 就是端正自己的心思；</li>
<li><span class="underline">修身</span> 就是加强自身修养，提高自身素质；</li>
<li><span class="underline">齐家</span> 就是管理好自己的家庭、家族；</li>
<li><span class="underline">治国、平天下</span> 是谈治理国家的事。</li>
</ul>

<p>
怎么样治理国家呢？首先要作表率；自己讨厌的，不加给别人；要得众、慎得、生财、举贤。“得众则得国，失众则失国”；“有德此有人，有人此有土，有土此有财”；见贤能举，举而能先。《大学》寄托了古人 <span class="underline">内圣外王</span> 的理想。
</p>
</div>

<div id="outline-container-org5342124" class="outline-3">
<h3 id="org5342124">经</h3>
<div class="outline-text-3" id="text-org5342124">
<blockquote>
<p>
大学之道，在明明德，在亲民，在止于至善。
</p>

<p>
知止而后有定，定而后能静，静而后能安，安而后能虑，虑而后能得。物有本末，事有终始。知所先后，则近道矣。
</p>

<p>
古之欲明明德于天下者，先治其国；欲治其国者，先齐其家；欲齐其家者，先修其身；欲修其身者，先正其心；欲正其心者，先诚其意；欲诚其意者，先致其知。致知在格物。物格而后知至，知至而后意诚，意诚而后心正，心正而后身修，身修而后家齐，家齐而后国治，国治而后天下平。自天子以至于庶人，壹是皆以修身为本。
</p>

<p>
其本乱而末治者，否矣。其所厚者薄，而其所薄者厚，未之有也。此谓知本，此谓知之至也。
</p>
</blockquote>

<p>
大学的道理，在于彰显人人本有，自身所具的光明德性，再推己及人，是人人都能去除污染而自新，而且精益求精，做到最完善的地步并且保持不变。
</p>

<p>
知道应达到的境界才能够志向坚定；志向坚定才能够镇静不躁；镇静不躁才能够心安理得；心安理得才能够思虑周详；思虑周详才能够有所收获。每样东西都有根本有枝末，每件事情都有开始有终结。明白了这本末始终的道理，就接近事物发展的规律了。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-01-14 Tue 20:28</p>
<p class="author">Author: Jack Liu</p>
<p class="date">Created: 2020-05-02 Sat 09:09</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
